var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "劳檬小破服",
    sex: "正常",
    age: "稳定开服不知道几天",
    phone: "没花钱（自豪）",
    email: "a?",
    address: "mdn.cooltec.icu",
    qq: "不告诉你",
    log: "本服介绍",
    excpect_work: "wsmdn.github.io",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "明天不一定会更好，但要坚信更好的明天一定会来。",
        "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
        "Gor For It!",
        "有智者立长志，无志者长立志。",
        "那些过去的眼泪终将风干在记忆里。",
        "真相，是为了剿灭幻想。",
        "我欲将心向明月，奈何明月照沟渠。",
        "春风得意马蹄疾，一日看尽长安花。",
        "天凉好个秋！",
        "老骥伏枥，志在千里。烈士暮年，壮心不已。",
        "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
        "我们必须拿我们所有的， 去换我们所没有的",
        "蒹葭苍苍，白露为霜；所谓伊人，在水一方。",
        "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "mdn欢迎您",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>玩家体验最大化</p>" +
        "<p>支出费用最小化</p>" +
        "<p>玩起来最nb化</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["连锁挖矿", 5, "purple"],
        ["季节系统", 90, "red"],
        ["无政府", 50, "blue"],
        ["养老", 85, "#1abc9c"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>连锁挖矿：破坏平衡</li>" +
        "     <li>季节系统：好玩爱玩多玩</li>" +
        "     <li>无政府：烂大街了都</li>" +
        "     <li>养老：适合我</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/baita.jpg","https://space.bilibili.com/2038640283?spm_id_from=333.337.0.0","挂壁","uuplayer"],
        ["./images/bowuguan.jpg", "https://wsmdn.github.io/toolbox/beixaun.html  ", "讨论区", "腐竹发明"],
        ["./images/xilamuren.jpg", "https://space.bilibili.com/1643709100?spm_id_from=333.788.0.0", "腐竹", "uuplayer:无法评价"],
        ["./images/xiangshawan.jpg", "", "主城", "美丽"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["", "<br>鸡块大佬 - 服务器之神",
            "<p>他给我提供了一个4h8g的云服务器</p>" +
            "<p>大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬</p>" +
            "<p>大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬</p>" +
            "<p>大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬大佬）。</p>" +
            "<img src='./images/6.png' alt='text'>" +
            "<p></p>"
        ],

        ["", "<br>uuplayer：提供了技术支持",
            "<p>本站，聊天站皆受到了他的帮助</p>" +
            "<p>他还参与了服务器的宣传，对我服提供了巨大帮助</p>" +
            "<p></p>" +
            "<p></p>" +
            "<img src='./images/bowuguan.jpg' alt='text'>"
        ],
        ["2024/5/3","<br>域名之神 寒星呀",
            "<p>他为本服提供了简单好记的域名</p>"+
            "<p>顺便宣传一下他的服务器</p>"+
            "<p>mc.cooltec.icu:21320版本1.20.1</p>"+
            "<p>官网：https://www.cooltec.icu/</p>"+
            "<img src='./images/7.png' alt='text'>"
        ],
    ],
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]




    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2021-04-28", "第十二届蓝桥杯大学生A组省三等奖", "大一下学期，我参与第十二届蓝桥杯大学生A组，然比赛一改以往暴力题，半数以上DP，仅取得省级三等奖。"],
        ["2021-04-24", "第六届团队程序设计天梯赛个人国家三等奖", "大一下学期，我通过面向全年级的选拔，获得入队名额，在个人赛中获得全国三等奖。"],
        ["2021-04-24", "第六届团队程序设计天梯赛团体国家二等奖", "大一下学期，我通过面向全年级的选拔，获得入队名额，跟随团队取得团体国家二等奖的成绩。"],
        ["2020-11-14", "2020级南昌大学程序设计正式赛三等奖", "大一上学期，我参与校举办的面向全校程序设计大赛并获得三等奖，"]
    ],
    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2021-04-28", "第十二届蓝桥杯大学生A组省三等奖", "大一下学期，我参与第十二届蓝桥杯大学生A组，然比赛一改以往暴力题，半数以上DP，仅取得省级三等奖。"],
        ["2021-04-24", "第六届团队程序设计天梯赛个人国家三等奖", "大一下学期，我通过面向全年级的选拔，获得入队名额，在个人赛中获得全国三等奖。"],
        ["2021-04-24", "第六届团队程序设计天梯赛团体国家二等奖", "大一下学期，我通过面向全年级的选拔，获得入队名额，跟随团队取得团体国家二等奖的成绩。"],
        ["2020-11-14", "2020级南昌大学程序设计正式赛三等奖", "大一上学期，我参与校举办的面向全校程序设计大赛并获得三等奖，"]
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        ["./svg/LeetCode.svg", "https://leetcode-cn.com/u/happysnaker/", "我的力扣主页"],
        ["./svg/github.svg", "https://github.com/happysnaker", "我的GitHub主页"],
        ["./svg/博客.svg", "http://1.15.234.109:8000", "我的个人博客"],
        ["./svg/掘金.svg", "https://juejin.cn/user/3853167638625000", "我的掘金主页"],
        ["./svg/知乎.svg", "https://www.zhihu.com/people/tian-xia-you-dao-81", "我的知乎主页"]
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/xilamuren.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}
